app/Controllers/User.php

SELECT *
FROM `users`
---
    public function getData()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'list' => $this->usermodel->find()
            ];