app/Controllers/User.php

    public function index()
    {
        $data = [
            'nav' => 'user',
            'nama' => 'Boboboy',
            'list' => $this->usermodel->find()
---
SELECT *
FROM `users`

                'password' => md5($this->request->getVar('password')),
                'avatar' => $namaavatar
            ];
            $this->usermodel->save($input);
---
INSERT INTO `users` (`nama`, `alamat`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `telepon`, `email`, `username`, `password`, `avatar`, `created_at`, `updated_at`) VALUES (' ', '', '', '', 'laki-laki', '', '', '', '8cb77052f63cc0b2316b352be2dc1e91', 'default.jpg', '2022-05-18 11:52:22', '2022-05-18 11:52:22')

    public function edit($id)
    {
        if ($this->request->isAJAX()) {
            $item = $this->usermodel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

                'password' => $pass,
                'avatar' => $namaavatar
            ];
            $this->usermodel->save($input);
---
UPDATE `users` SET `nama` = 'Raynoldd Purnomo', `alamat` = 'Nusukan', `tempat_lahir` = 'Surakartans', `tanggal_lahir` = '2022-04-20', `jenis_kelamin` = 'laki-laki', `telepon` = '0856465468', `email` = 'raynold@student.uns.ac.id', `username` = 'Raynolds', `password` = '20eabe5d64b0e216796e834f52d61fd0b70332fc', `avatar` = 'pic1.jpg', `updated_at` = '2022-06-01 05:06:41'
WHERE `users`.`id` IN ('1')

    public function getData()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'list' => $this->usermodel->find()
            ];
---
SELECT *
FROM `users`