app/Models/UserModel.php

    function getDetail($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1